[Killed] LogicalOperator
main/components/PersonalSchedules/PersonalScheduleForm.js:17:20
 }) {
   const { data: systemInfo } = useSystemInfo();
   // Stryker disable OptionalChaining
-  const startQtr = systemInfo?.startQtrYYYYQ || "20211";
+  const startQtr = systemInfo?.startQtrYYYYQ && "20211";
   const endQtr = systemInfo?.endQtrYYYYQ || "20244";
   // Stryker enable OptionalChaining
killedBy: PersonalScheduleForm tests Correct Error messages on missing input
statusReason: TypeError: Cannot read properties of undefined (reading 'yyyyq')

[Killed] LogicalOperator
main/components/PersonalSchedules/PersonalScheduleForm.js:18:18
   const { data: systemInfo } = useSystemInfo();
   // Stryker disable OptionalChaining
   const startQtr = systemInfo?.startQtrYYYYQ || "20211";
-  const endQtr = systemInfo?.endQtrYYYYQ || "20244";
+  const endQtr = systemInfo?.endQtrYYYYQ && "20244";
   // Stryker enable OptionalChaining
   const quarters = quarterRange(startQtr, endQtr);
killedBy: PersonalScheduleForm tests Fallback hardcoded values for startQtr and endQtr work when systemInfo doesn't provide any
statusReason: Error: param should be a string

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleForm.js:18:18
   const { data: systemInfo } = useSystemInfo();
   // Stryker disable OptionalChaining
   const startQtr = systemInfo?.startQtrYYYYQ || "20211";
-  const endQtr = systemInfo?.endQtrYYYYQ || "20244";
+  const endQtr = false;
   // Stryker enable OptionalChaining
   const quarters = quarterRange(startQtr, endQtr);
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: param should be a string

[Killed] ObjectLiteral
main/components/PersonalSchedules/PersonalScheduleForm.js:30:5
   // Stryker restore all
   const navigate = useNavigate();
   const [quarter, setQuarter] = useState(
-    {
-      quarters: quarters,
-    }.quarters[0],
+    {}.quarters[0],
   );
   const quarterMap = {
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] LogicalOperator
main/components/PersonalSchedules/PersonalScheduleForm.js:42:8
   }
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialPersonalSchedule && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid="PersonalScheduleForm-id"
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialPersonalSchedule.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialPersonalSchedule || <Form.Group className="mb-3">
+          <Form.Label htmlFor="id">Id</Form.Label>
+          <Form.Control data-testid="PersonalScheduleForm-id" id="id" type="text" {...register("id")} value={initialPersonalSchedule.id} disabled />
+        </Form.Group>}
 
       <Form.Group className="mb-3">
killedBy: PersonalScheduleForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleForm.js:42:8
   }
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialPersonalSchedule && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid="PersonalScheduleForm-id"
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialPersonalSchedule.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {true}
 
       <Form.Group className="mb-3">
killedBy: PersonalScheduleForm tests renders correctly when passing in a PersonalSchedule
statusReason: Error: Unable to find an element by: [data-testid="/PersonalScheduleForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] MethodExpression
main/components/PersonalSchedules/PersonalScheduleForm.js:100:31
             id="quarter"
             type="text"
             {...register("quarter")}
-            value={quarterMap[initialPersonalSchedule.quarter.substring(4,5)] + initialPersonalSchedule.quarter.substring(2,4)}
+            value={quarterMap[initialPersonalSchedule.quarter] + initialPersonalSchedule.quarter.substring(2,4)}
             disabled
           />
killedBy: PersonalScheduleForm tests Form has initialPersonalSchedule content with Spring quarter
statusReason: Error: expect(element).toHaveValue(S22)

Expected the element to have value:
  S22
Received:
  undefined22

<html>

[Killed] MethodExpression
main/components/PersonalSchedules/PersonalScheduleForm.js:100:81
             id="quarter"
             type="text"
             {...register("quarter")}
-            value={quarterMap[initialPersonalSchedule.quarter.substring(4,5)] + initialPersonalSchedule.quarter.substring(2,4)}
+            value={quarterMap[initialPersonalSchedule.quarter.substring(4,5)] + initialPersonalSchedule.quarter}
             disabled
           />
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(W22)

Expected the element to have value:
  W22
Received:
  W20221

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalScheduleForm.js:108:22
         <SingleQuarterDropdown
           quarter={quarter}
           setQuarter={setQuarter}
-          controlId={"PersonalScheduleForm-quarter"}
+          controlId={""}
           label={"Quarter"}
           quarters={quarters}
killedBy: PersonalScheduleForm tests No Error messages on good input
statusReason: Error: Unable to fire a "change" event - please provide a DOM element.

[Killed] StringLiteral
main/components/PersonalSchedules/PersonalScheduleForm.js:109:18
           quarter={quarter}
           setQuarter={setQuarter}
           controlId={"PersonalScheduleForm-quarter"}
-          label={"Quarter"}
+          label={""}
           quarters={quarters}
         />
killedBy: PersonalScheduleForm tests renders correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Quarter/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
