[Killed] BlockStatement
main/components/Quarters/SingleQuarterDropdown.js:25:28
   label = "Quarter",
 }) {
   const localSearchQuarter = localStorage.getItem(controlId);
-  if (!localSearchQuarter) {
-    localStorage.setItem(controlId, quarters[0].yyyyq);
-  }
+  if (!localSearchQuarter) {}
   console.log(localSearchQuarter);
   const [quarterState, setQuarterState] = useState(
killedBy: SingleQuarterSelector tests when localstorage has no value, first element of quarter range is the default parameter
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "sqd1", "20201"

Number of calls: 0

<html>
  <head />

[Killed] BooleanLiteral
main/components/Quarters/SingleQuarterDropdown.js:25:7
   label = "Quarter",
 }) {
   const localSearchQuarter = localStorage.getItem(controlId);
-  if (!localSearchQuarter) {
+  if (localSearchQuarter) {
     localStorage.setItem(controlId, quarters[0].yyyyq);
   }
killedBy: AdminJobsPage tests user can submit the update course data by quarter job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/jobs/launch/updateQuarterCourses?quarterYYYYQ=20211"
Received: "/api/jobs/launch/updateQuarterCourses?quarterYYYYQ=20084"

[Killed] BlockStatement
main/components/Quarters/SingleQuarterDropdown.js:35:44
     quarter.yyyyq || localSearchQuarter || quarters[0].yyyyq,
   );
 
-  const handleQuarterOnChange = (event) => {
-    const selectedQuarter = event.target.value;
-    localStorage.setItem(controlId, selectedQuarter);
-    setQuarterState(selectedQuarter);
-    setQuarter(selectedQuarter);
-    if (onChange != null) {
-      onChange(event);
-    }
-  };
+  const handleQuarterOnChange = (event) => {};
 
   return (
killedBy: AdminJobsPage tests user can submit the update course data job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/jobs/launch/updateCourses?quarterYYYYQ=20211&subjectArea=ANTH"
Received: "/api/jobs/launch/updateCourses?quarterYYYYQ=20221&subjectArea=ANTH"

[Killed] ConditionalExpression
main/components/Quarters/SingleQuarterDropdown.js:40:9
     localStorage.setItem(controlId, selectedQuarter);
     setQuarterState(selectedQuarter);
     setQuarter(selectedQuarter);
-    if (onChange != null) {
+    if (false) {
       onChange(event);
     }
killedBy: SingleQuarterSelector tests if I pass a non-null onChange, it gets called when the value changes
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/components/Quarters/SingleQuarterDropdown.js:40:9
     localStorage.setItem(controlId, selectedQuarter);
     setQuarterState(selectedQuarter);
     setQuarter(selectedQuarter);
-    if (onChange != null) {
+    if (true) {
       onChange(event);
     }
killedBy: AdminJobsPage tests user can submit the update course data job
statusReason: TypeError: onChange is not a function

[Killed] BlockStatement
main/components/Quarters/SingleQuarterDropdown.js:53:44
         value={quarterState}
         onChange={handleQuarterOnChange}
       >
-        {quarters.map(function (object, i) {
-          const key = `${controlId}-option-${i}`;
-          return (
-            <option key={key} data-testid={key} value={object.yyyyq}>
-              {object.qyy}
-            </option>
-          );
-        })}
+        {quarters.map(function (object, i) {})}
       </Form.Control>
     </Form.Group>
killedBy: AdminJobsPage tests user can submit the update course data job
statusReason: TestingLibraryElementError: Value "20211" not found in options

Ignored nodes: comments, <script />, <style />
<select
  class="form-control"
  id="BasicSearch.Quarter"
/>
