[Killed] BooleanLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:10:65
 import { toast } from "react-toastify";
 import { useCurrentUser } from "main/utils/currentUser";
 
-export default function PersonalSchedulesEditPage({ storybook = false }) {
+export default function PersonalSchedulesEditPage({ storybook = true }) {
   let { id } = useParams();
   const currentUser = useCurrentUser();
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/personalschedules/list"}

Number of calls: 0

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:24:12
     {
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
-      url: `/api/personalschedules`,
+      url: ``,
       params: {
         id,
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="PersonalScheduleForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:38:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/courses/user/psid/all?psId=${id}`],
-    {
-      // Stryker disable next-line StringLiteral : GET is default, so replacing with "" is an equivalent mutation
-      method: "GET",
-      url: `/api/courses/user/psid/all?psId=${id}`,
-      // params: {
-      //   id,
-      // },
-    },
+    {},
     [],
   );
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally renders two courses without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:49:34
     [],
   );
 
-  const objectToAxiosPutParams = (personalSchedule) => ({
-    url: "/api/personalschedules",
-    method: "PUT",
-    params: {
-      id: personalSchedule.id,
-    },
-    data: {
-      user: personalSchedule.user,
-      name: personalSchedule.name,
-      description: personalSchedule.description,
-      quarter: personalSchedule.quarter,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (personalSchedule) => {
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "PersonalSchedule Updated - id: 17 name: Winter Courses"
Received: "useBackendMutation: Error communicating with backend via get on undefined"

Number of calls: 1

[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:49:57
     [],
   );
 
-  const objectToAxiosPutParams = (personalSchedule) => ({
-    url: "/api/personalschedules",
-    method: "PUT",
-    params: {
-      id: personalSchedule.id,
-    },
-    data: {
-      user: personalSchedule.user,
-      name: personalSchedule.name,
-      description: personalSchedule.description,
-      quarter: personalSchedule.quarter,
-    },
-  });
+  const objectToAxiosPutParams = (personalSchedule) => ({});
 
   const onSuccess = (personalSchedule) => {
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "PersonalSchedule Updated - id: 17 name: Winter Courses"
Received: "useBackendMutation: Error communicating with backend via get on undefined"

Number of calls: 1

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:50:10
   );
 
   const objectToAxiosPutParams = (personalSchedule) => ({
-    url: "/api/personalschedules",
+    url: "",
     method: "PUT",
     params: {
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "PersonalSchedule Updated - id: 17 name: Winter Courses"
Received: "useBackendMutation: Error communicating with backend via put on "

Number of calls: 1

[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:55:11
     params: {
       id: personalSchedule.id,
     },
-    data: {
-      user: personalSchedule.user,
-      name: personalSchedule.name,
-      description: personalSchedule.description,
-      quarter: personalSchedule.quarter,
-    },
+    data: {},
   });
 
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: "{}"

[Killed] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:63:43
     },
   });
 
-  const onSuccess = (personalSchedule) => {
-    toast(
-      `PersonalSchedule Updated - id: ${personalSchedule.id} name: ${personalSchedule.name}`,
-    );
-    console.log(personalSchedule.quarter);
-  };
+  const onSuccess = (personalSchedule) => {};
 
   const mutation = useBackendMutation(
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "PersonalSchedule Updated - id: 17 name: Winter Courses"
Received: "useBackend: Error communicating with backend via GET on /api/courses/user/psid/all?psId=17: Error: Request failed with status code 404"

Number of calls: 1

[Killed] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:83:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/personalschedules/list" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/personalschedules/list"}

Number of calls: 0

[Killed] LogicalOperator
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:91:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Personal Schedule</h1>
-        {personalSchedule && (
-          <PersonalScheduleForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialPersonalSchedule={personalSchedule}
-          />
-        )}
+        {personalSchedule || <PersonalScheduleForm submitAction={onSubmit} buttonLabel={"Update"} initialPersonalSchedule={personalSchedule} />}
         <p className="py-5">
           <h1>Courses</h1>
killedBy: PersonalSchedulesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="PersonalScheduleForm-name" id="name" name="name" type="text" /> instead

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:91:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Personal Schedule</h1>
-        {personalSchedule && (
-          <PersonalScheduleForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialPersonalSchedule={personalSchedule}
-          />
-        )}
+        {true}
         <p className="py-5">
           <h1>Courses</h1>
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="PersonalScheduleForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
