[Killed] BlockStatement
main/pages/Courses/PSCourseCreatePage.js:20:33
     },
   });
 
-  const onSuccess = (course) => {
-    toast(
-      `New course Created - id: ${course[0].id} enrollCd: ${course[0].enrollCd}`
-    );
-  };
+  const onSuccess = (course) => {};
 
   const mutation = useBackendMutation(
killedBy: CoursesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New course Created - id: 17 enrollCd: 08250"
Received: "useBackend: Error communicating with backend via GET on /api/personalschedules/all: Error: Request failed with status code 404"

Number of calls: 1

[Killed] StringLiteral
main/pages/Courses/PSCourseCreatePage.js:22:7
 
   const onSuccess = (course) => {
     toast(
-      `New course Created - id: ${course[0].id} enrollCd: ${course[0].enrollCd}`
+      ``
     );
   };
killedBy: CoursesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New course Created - id: 17 enrollCd: 08250"
Received
       1: "useBackend: Error communicating with backend via GET on /api/personalschedules/all: Error: Request failed with status code 404"
       2: ""

Number of calls: 2
