[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/personalschedules?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/personalschedules`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="PersonalScheduleForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:59:21
   const { isSuccess } = mutation;
 
   const onSubmit = async (data) => {
-    const quarter = {
-      quarter: localStorage["PersonalScheduleForm-quarter"],
-    };
+    const quarter = {};
     console.log(quarter);
     const dataFinal = Object.assign(data, quarter);
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality
