[Killed] BlockStatement
main/components/Courses/CourseForm.js:40:19
   }
   // Stryker restore all
 
-  useEffect(() => {
-    if (schedules && schedules.length > 0 && !localSchedule) {
-      setSchedule(schedules[0].id);
-      // Stryker disable all : not sure how to test/mock local storage
-      localStorage.setItem("CourseForm-psId", schedules[0].id);
-      // Stryker restore all
-    }
-  }, [schedules, localSchedule]);
+  useEffect(() => {}, [schedules, localSchedule]);
 
   return (
killedBy: CoursesCreatePage tests sets schedule and updates localStorage when schedules are available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "17"
Received: ""

[Killed] EqualityOperator
main/components/Courses/CourseForm.js:41:22
   // Stryker restore all
 
   useEffect(() => {
-    if (schedules && schedules.length > 0 && !localSchedule) {
+    if (schedules && schedules.length <= 0 && !localSchedule) {
       setSchedule(schedules[0].id);
       // Stryker disable all : not sure how to test/mock local storage
killedBy: CourseForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
main/components/Courses/CourseForm.js:41:9
   // Stryker restore all
 
   useEffect(() => {
-    if (schedules && schedules.length > 0 && !localSchedule) {
+    if (schedules || schedules.length > 0 && !localSchedule) {
       setSchedule(schedules[0].id);
       // Stryker disable all : not sure how to test/mock local storage
killedBy: CoursesCreatePage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'id')
