[Killed] ObjectLiteral
main/components/Courses/CourseTable.js:33:5
       Header: "Course Name",
       accessor: "courseName",
     },
-    {
-      Header: "Enrollment Code",
-      accessor: "enrollCd",
-    },
+    {},
     {
       Header: "Personal Schedule ID",
killedBy: CoursesIndexPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CourseTable.js:35:17
     },
     {
       Header: "Enrollment Code",
-      accessor: "enrollCd",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected colum headers and content for Ordinary User
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-enrollCd"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
