[Killed] ArrowFunction
main/pages/Courses/PSCourseCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function CoursesCreatePage() {
-  const objectToAxiosParams = (course) => ({
-    url: "/api/courses/post",
-    method: "POST",
-    params: {
-      courseName: course.courseName,
-      enrollCd: course.enrollCd,
-      psId: course.psId,
-      schduleName: course.schduleName,
-      quarter: course.quarter,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (course) => {
killedBy: CoursesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Courses/PSCourseCreatePage.js:22:7
 
   const onSuccess = (course) => {
     toast(
-      `New course Created - id: ${course[0].id} enrollCd: ${course[0].enrollCd}`,
+      ``,
     );
   };
killedBy: CoursesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New course Created - id: 17 enrollCd: 08250"
Received
       1: "useBackend: Error communicating with backend via GET on /api/personalschedules/all: Error: Request failed with status code 404"
       2: ""

Number of calls: 2

[Killed] BlockStatement
main/pages/Courses/PSCourseCreatePage.js:35:36
 
   const { isSuccess } = mutation;
 
-  const onSubmit = async (data) => {
-    const psId = {
-      psId: localStorage["CourseForm-psId"],
-    };
-    const dataFinal = Object.assign(data, psId);
-    mutation.mutate(dataFinal);
-  };
+  const onSubmit = async (data) => {};
 
   if (isSuccess) {
killedBy: CoursesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
