[Killed] ArrowFunction
src/main/pages/AdminJobsPage.js:46:61
     method: "POST",
   });
 
-  const objectToAxiosParamsUpdateCoursesByQuarterRangeJob = (data) => ({
-    url: `/api/jobs/launch/updateCoursesRangeOfQuarters?start_quarterYYYYQ=${data.startQuarter}&end_quarterYYYYQ=${data.endQuarter}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateCoursesByQuarterRangeJob = () => undefined;
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit the update course data by quarter range job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/AdminJobsPage.js:107:13
       form: <UpdateCoursesJobForm callback={submitUpdateCoursesJob} />,
     },
     {
-      name: "Update Courses Database by quarter",
+      name: "",
       form: (
         <UpdateCoursesByQuarterJobForm
killedBy: AdminJobsPage tests user can submit the update course data by quarter job
statusReason: Error: Unable to find an element with the text: Update Courses Database by quarter. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
