[Killed] ObjectLiteral
main/pages/Courses/PSCourseIndexPage.js:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/courses/user/all"],
-    {
-      // Stryker disable next-line StringLiteral : GET is default, so replacing with "" is an equivalent mutation
-      method: "GET",
-      url: "/api/courses/user/all",
-    },
+    {},
     [],
   );
killedBy: CoursesIndexPage tests renders two courses without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Survived] BlockStatement
main/pages/Courses/PSCourseIndexPage.js:25:30
     },
     [],
   );
-  const createButton = () => {
-    // if (hasRole(currentUser, "ROLE_ADMIN")) {
-        return (
-            <Button
-                variant="primary"
-                href="/courses/create"
-                style={{ float: "right" }}
-            >
-                Add Course
-            </Button>
-        )
-    // } 
-  }
+  const createButton = () => {}
 
   return (
