[Killed] ArrayDeclaration
main/pages/PersonalSchedules/PersonalSchedulesIndexPage.js:20:5
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/personalschedules/all"],
     { method: "GET", url: "/api/personalschedules/all" },
-    [],
+    ["Stryker was here"],
   );
 
killedBy: PersonalSchedulesIndexPage tests renders without crashing for regular user
statusReason: Error: Invalid data value

[Survived] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesIndexPage.js:23:30
     [],
   );
 
-  const createButton = () => {
-    // if (hasRole(currentUser, "ROLE_ADMIN")) {
-        return (
-            <Button
-                variant="primary"
-                href="/personalschedules/create"
-                style={{ float: "right" }}
-            >
-                Add Personal Schedule
-            </Button>
-        )
-    // } 
-  }
+  const createButton = () => {}
 
   return (
